In [49]:
import pandas as pd

titanic_train = pd.read_csv(r"/Users/osulalam/Documents/Projects/Titanic/train.csv")
print(titanic_train.head(), titanic_train.shape)

   PassengerId  Survived  Pclass  \
0            1         0       3
1            2         1       1
2            3         1       3
3            4         1       1
4            5         0       3

                                                Name     Sex   Age  SibSp  \
0                            Braund, Mr. Owen Harris    male  22.0      1
1  Cumings, Mrs. John Bradley (Florence Briggs Th...  female  38.0      1
2                             Heikkinen, Miss. Laina  female  26.0      0
3       Futrelle, Mrs. Jacques Heath (Lily May Peel)  female  35.0      1
4                           Allen, Mr. William Henry    male  35.0      0

   Parch            Ticket     Fare Cabin Embarked
0      0         A/5 21171   7.2500   NaN        S
1      0          PC 17599  71.2833   C85        C
2      0  STON/O2. 3101282   7.9250   NaN        S
3      0            113803  53.1000  C123        S
4      0            373450   8.0500   NaN        S   (891, 12)

In [50]:
titanic_train.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [51]:
test = pd.read_csv(r"/Users/osulalam/Documents/Projects/Titanic/test.csv")

In [52]:
test.isnull().sum()

PassengerId      0
Pclass           0
Name             0
Sex              0
Age             86
SibSp            0
Parch            0
Ticket           0
Fare             1
Cabin          327
Embarked         0
dtype: int64

In [53]:
test.shape

(418, 11)

In [54]:
test[test['Fare'].isnull()]

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
152,1044,3,"Storey, Mr. Thomas",male,60.5,0,0,3701,NaN,NaN,S

In [55]:
titanic_train['Fare'].describe()

count    891.000000
mean      32.204208
std       49.693429
min        0.000000
25%        7.910400
50%       14.454200
75%       31.000000
max      512.329200
Name: Fare, dtype: float64

In [56]:
titanic_train.groupby(['Survived','Sex','Pclass'])['Fare'].median()

Survived  Sex     Pclass
0         female  1         151.55000
                  2          17.00000
                  3          14.47915
          male    1          42.40000
                  2          13.00000
                  3           7.89580
1         female  1          82.17080
                  2          23.00000
                  3           9.46875
          male    1          35.50000
                  2          18.75000
                  3           8.05000
Name: Fare, dtype: float64

In [57]:
test['Fare'] = test['Fare'].fillna((7.8958+8.05)/2)
(7.8958+8.05)/2

7.972900000000001

In [58]:
test.isnull().sum()

PassengerId      0
Pclass           0
Name             0
Sex              0
Age             86
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          327
Embarked         0
dtype: int64

In [59]:
titanic_train['Embarked'].value_counts()

S    644
C    168
Q     77
Name: Embarked, dtype: int64

In [60]:
#only 2 missing values let's print rows with missing values
titanic_train[titanic_train['Embarked'].isnull()]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
61,62,1,1,"Icard, Miss. Amelie",female,38.0,0,0,113572,80.0,B28,NaN
829,830,1,1,"Stone, Mrs. George Nelson (Martha Evelyn)",female,62.0,0,0,113572,80.0,B28,NaN

In [61]:
import seaborn as sns
import matplotlib.pyplot as plt
%matplotlib inline

fig, (ax1, ax2) = plt.subplots(1, 2, figsize=(12, 5))
sns.factorplot(x='Embarked', y='Survived', data=titanic_train, ax=ax1)
sns.boxplot(x='Embarked', y='Fare', data=titanic_train, ax=ax2)
plt.close(2)

ImportError: No module named 'seaborn'

Since passengers with higher fares and high mean survival embarked from 'C', we'll fill the 2 missing values with this location.

In [62]:
titanic_train['Embarked'] = titanic_train['Embarked'].fillna('C')

titanic_train.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         0
dtype: int64

In [63]:
titanic_train['Embarked'].value_counts()

S    644
C    170
Q     77
Name: Embarked, dtype: int64

In [64]:
titanic_train['Cabin'].value_counts()

G6             4
B96 B98        4
C23 C25 C27    4
C22 C26        3
D              3
F33            3
F2             3
E101           3
F4             2
E121           2
D35            2
C93            2
B51 B53 B55    2
E67            2
E8             2
C52            2
D20            2
C125           2
B20            2
B5             2
C2             2
D36            2
C126           2
D33            2
E33            2
E44            2
B77            2
C68            2
C78            2
D26            2
              ..
D21            1
B73            1
C118           1
A19            1
D46            1
C62 C64        1
A34            1
B38            1
B39            1
B30            1
C7             1
B102           1
B19            1
C46            1
A32            1
C50            1
B4             1
E38            1
E34            1
E50            1
D9             1
A31            1
B80            1
T              1
B86            1
C70            1
B42            1
E46            1
B3             1
A24            1
Name: Cabin, Length: 147, dtype: int64

In [65]:
#going to create a new variable for Cabin containing only the 1st letter
titanic_train['Cabin_ID'] = titanic_train['Cabin'].str[0]
test['Cabin_ID'] = test['Cabin'].str[0]
titanic_train.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Cabin_ID
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,NaN
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,NaN
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S,C
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S,NaN

In [66]:
test.head()

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Cabin_ID
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q,NaN
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S,NaN
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q,NaN
3,895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S,NaN
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S,NaN

In [67]:
from sklearn import preprocessing

label_encoder = preprocessing.LabelEncoder()
label_encoder.fit(list(titanic_train['Sex'].values)+list(test['Sex'].values))
titanic_train['Sex'] = label_encoder.transform(list(titanic_train['Sex'].values))
test['Sex'] = label_encoder.transform(list(test['Sex'].values))
titanic_train.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Cabin_ID
0,1,0,3,"Braund, Mr. Owen Harris",1,22.0,1,0,A/5 21171,7.2500,NaN,S,NaN
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",0,38.0,1,0,PC 17599,71.2833,C85,C,C
2,3,1,3,"Heikkinen, Miss. Laina",0,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,NaN
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",0,35.0,1,0,113803,53.1000,C123,S,C
4,5,0,3,"Allen, Mr. William Henry",1,35.0,0,0,373450,8.0500,NaN,S,NaN

In [68]:
test.head()

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Cabin_ID
0,892,3,"Kelly, Mr. James",1,34.5,0,0,330911,7.8292,NaN,Q,NaN
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",0,47.0,1,0,363272,7.0000,NaN,S,NaN
2,894,2,"Myles, Mr. Thomas Francis",1,62.0,0,0,240276,9.6875,NaN,Q,NaN
3,895,3,"Wirz, Mr. Albert",1,27.0,0,0,315154,8.6625,NaN,S,NaN
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",0,22.0,1,1,3101298,12.2875,NaN,S,NaN

In [69]:
Embark_dum = pd.get_dummies(titanic_train['Embarked'])
Embark_dumt = pd.get_dummies(test['Embarked'])
Embark_dum.head()

   C  Q  S
0  0  0  1
1  1  0  0
2  0  0  1
3  0  0  1
4  0  0  1

In [70]:
Embark_dumt.head()

   C  Q  S
0  0  1  0
1  0  0  1
2  0  1  0
3  0  0  1
4  0  0  1

In [71]:
titanic_train['Embark_C'], test['Embark_C'] = Embark_dum['C'], Embark_dumt['C']
titanic_train['Embark_Q'], test['Embark_Q'] = Embark_dum['Q'], Embark_dumt['Q']
titanic_train.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Cabin_ID,Embark_C,Embark_Q
0,1,0,3,"Braund, Mr. Owen Harris",1,22.0,1,0,A/5 21171,7.2500,NaN,S,NaN,0,0
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",0,38.0,1,0,PC 17599,71.2833,C85,C,C,1,0
2,3,1,3,"Heikkinen, Miss. Laina",0,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,NaN,0,0
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",0,35.0,1,0,113803,53.1000,C123,S,C,0,0
4,5,0,3,"Allen, Mr. William Henry",1,35.0,0,0,373450,8.0500,NaN,S,NaN,0,0

In [72]:
test.head()

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Cabin_ID,Embark_C,Embark_Q
0,892,3,"Kelly, Mr. James",1,34.5,0,0,330911,7.8292,NaN,Q,NaN,0,1
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",0,47.0,1,0,363272,7.0000,NaN,S,NaN,0,0
2,894,2,"Myles, Mr. Thomas Francis",1,62.0,0,0,240276,9.6875,NaN,Q,NaN,0,1
3,895,3,"Wirz, Mr. Albert",1,27.0,0,0,315154,8.6625,NaN,S,NaN,0,0
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",0,22.0,1,1,3101298,12.2875,NaN,S,NaN,0,0

# Imputing Missing Age Variable

In [73]:
# new dataframe containing rows with known ages
new_train = titanic_train[titanic_train['Age'].notnull()]
new_train.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Cabin_ID,Embark_C,Embark_Q
0,1,0,3,"Braund, Mr. Owen Harris",1,22.0,1,0,A/5 21171,7.2500,NaN,S,NaN,0,0
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",0,38.0,1,0,PC 17599,71.2833,C85,C,C,1,0
2,3,1,3,"Heikkinen, Miss. Laina",0,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,NaN,0,0
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",0,35.0,1,0,113803,53.1000,C123,S,C,0,0
4,5,0,3,"Allen, Mr. William Henry",1,35.0,0,0,373450,8.0500,NaN,S,NaN,0,0

In [74]:
new_test = test[test['Age'].notnull()]
new_test.head()

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Cabin_ID,Embark_C,Embark_Q
0,892,3,"Kelly, Mr. James",1,34.5,0,0,330911,7.8292,NaN,Q,NaN,0,1
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",0,47.0,1,0,363272,7.0000,NaN,S,NaN,0,0
2,894,2,"Myles, Mr. Thomas Francis",1,62.0,0,0,240276,9.6875,NaN,Q,NaN,0,1
3,895,3,"Wirz, Mr. Albert",1,27.0,0,0,315154,8.6625,NaN,S,NaN,0,0
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",0,22.0,1,1,3101298,12.2875,NaN,S,NaN,0,0

In [96]:
X = new_train.iloc[:, [1,2,4,6,7,9,13,14]].values
y = new_train.iloc[:, 5].values
print(X, y)

[[  0.       3.       1.     ...,   7.25     0.       0.    ]
 [  1.       1.       0.     ...,  71.2833   1.       0.    ]
 [  1.       3.       0.     ...,   7.925    0.       0.    ]
 ...,
 [  1.       1.       0.     ...,  30.       0.       0.    ]
 [  1.       1.       1.     ...,  30.       1.       0.    ]
 [  0.       3.       1.     ...,   7.75     0.       1.    ]] [ 22.    38.    26.    35.    35.    54.     2.    27.    14.     4.    58.
  20.    39.    14.    55.     2.    31.    35.    34.    15.    28.     8.
  38.    19.    40.    66.    28.    42.    21.    18.    14.    40.    27.
   3.    19.    18.     7.    21.    49.    29.    65.    21.    28.5    5.
  11.    22.    38.    45.     4.    29.    19.    17.    26.    32.    16.
  21.    26.    32.    25.     0.83  30.    22.    29.    28.    17.    33.
  16.    23.    24.    29.    20.    46.    26.    59.    71.    23.    34.
  34.    28.    21.    33.    37.    28.    21.    38.    47.    14.5   22.
  20.    17.    21.    70.5   29.    24.     2.    21.    32.5   32.5   54.
  12.    24.    45.    33.    20.    47.    29.    25.    23.    19.    37.
  16.    24.    22.    24.    19.    18.    19.    27.     9.    36.5   42.
  51.    22.    55.5   40.5   51.    16.    30.    44.    40.    26.    17.
   1.     9.    45.    28.    61.     4.     1.    21.    56.    18.    50.
  30.    36.     9.     1.     4.    45.    40.    36.    32.    19.    19.
   3.    44.    58.    42.    24.    28.    34.    45.5   18.     2.    32.
  26.    16.    40.    24.    35.    22.    30.    31.    27.    42.    32.
  30.    16.    27.    51.    38.    22.    19.    20.5   18.    35.    29.
  59.     5.    24.    44.     8.    19.    33.    29.    22.    30.    44.
  25.    24.    37.    54.    29.    62.    30.    41.    29.    30.    35.
  50.     3.    52.    40.    36.    16.    25.    58.    35.    25.    41.
  37.    63.    45.     7.    35.    65.    28.    16.    19.    33.    30.
  22.    42.    22.    26.    19.    36.    24.    24.    23.5    2.    50.
  19.     0.92  17.    30.    30.    24.    18.    26.    28.    43.    26.
  24.    54.    31.    40.    22.    27.    30.    22.    36.    61.    36.
  31.    16.    45.5   38.    16.    29.    41.    45.    45.     2.    24.
  28.    25.    36.    24.    40.     3.    42.    23.    15.    25.    28.
  22.    38.    40.    29.    45.    35.    30.    60.    24.    25.    18.
  19.    22.     3.    22.    27.    20.    19.    42.     1.    32.    35.
  18.     1.    36.    17.    36.    21.    28.    23.    24.    22.    31.
  46.    23.    28.    39.    26.    21.    28.    20.    34.    51.     3.
  21.    33.    44.    34.    18.    30.    10.    21.    29.    28.    18.
  28.    19.    32.    28.    42.    17.    50.    14.    21.    24.    64.
  31.    45.    20.    25.    28.     4.    13.    34.     5.    52.    36.
  30.    49.    29.    65.    50.    48.    34.    47.    48.    38.    56.
   0.75  38.    33.    23.    22.    34.    29.    22.     2.     9.    50.
  63.    25.    35.    58.    30.     9.    21.    55.    71.    21.    54.
  25.    24.    17.    21.    37.    16.    18.    33.    28.    26.    29.
  36.    54.    24.    47.    34.    36.    32.    30.    22.    44.    40.5
  50.    39.    23.     2.    17.    30.     7.    45.    30.    22.    36.
   9.    11.    32.    50.    64.    19.    33.     8.    17.    27.    22.
  22.    62.    48.    39.    36.    40.    28.    24.    19.    29.    32.
  62.    53.    36.    16.    19.    34.    39.    32.    25.    39.    54.
  36.    18.    47.    60.    22.    35.    52.    47.    37.    36.    49.
  49.    24.    44.    35.    36.    30.    27.    22.    40.    39.    35.
  24.    34.    26.     4.    26.    27.    42.    20.    21.    21.    61.
  57.    21.    26.    80.    51.    32.     9.    28.    32.    31.    41.
  20.    24.     2.     0.75  48.    19.    56.    23.    18.    21.    18.
  24.    32.    23.    58.    50.    40.    47.    36.    20.    32.    25.
  43.    40.    31.    70.    31.    18.    24.5   18.    43.    36.    27.
  20.    14.    60.    25.    14.    19.    18.    15.    31.     4.    25.
  60.    52.    44.    49.    42.    18.    35.    18.    25.    26.    39.
  45.    42.    22.    24.    48.    29.    52.    19.    38.    27.    33.
   6.    17.    34.    50.    27.    20.    30.    25.    25.    29.    11.
  23.    23.    28.5   48.    35.    36.    21.    24.    31.    70.    16.
  30.    19.    31.     4.     6.    33.    23.    48.     0.67  28.    18.
  34.    33.    41.    20.    36.    16.    51.    30.5   32.    24.    48.
  57.    54.    18.     5.    43.    13.    17.    29.    25.    25.    18.
   8.     1.    46.    16.    25.    39.    49.    31.    30.    30.    34.
  31.    11.     0.42  27.    31.    39.    18.    39.    33.    26.    39.
  35.     6.    30.5   23.    31.    43.    10.    52.    27.    38.    27.
   2.     1.    62.    15.     0.83  23.    18.    39.    21.    32.    20.
  16.    30.    34.5   17.    42.    35.    28.     4.    74.     9.    16.
  44.    18.    45.    51.    24.    41.    21.    48.    24.    42.    27.
  31.     4.    26.    47.    33.    47.    28.    15.    20.    19.    56.
  25.    33.    22.    28.    25.    39.    27.    19.    26.    32.  ]

In [85]:
Xt = new_test.iloc[:,[1,3,5,6,8,12,13]].values
yt = new_test.iloc[:, 4].values

## Predicting Age Using Lasso Regression

In [90]:
from sklearn import linear_model
from sklearn.cross_validation import train_test_split
from sklearn.metrics import mean_squared_error

X_train, X_val, y_train, y_val = train_test_split(X, y, test_size=.2, random_state=0)
reg = linear_model.Lasso(alpha=.1)
reg.fit(X_train, y_train)
y_pred = reg.predict(X_val)
mean_squared_error(y_val, y_pred)

145.41022252507383

## Predicting Age Using Ridge Regression

In [91]:
reg = linear_model.Ridge(alpha=.1)
reg.fit(X_train, y_train)
y_pred = reg.predict(X_val)
mean_squared_error(y_val, y_pred)

143.96631219838298

In [92]:
X_test, X_valt, y_test, y_valt = train_test_split(Xt, yt, test_size=.2, random_state=0)
reg.fit(X_test, y_test)
y_predt = reg.predict(X_valt)
mean_squared_error(y_valt, y_predt)

151.78128873784493

Comparing the MSE of the regression models when its average MSE is used instead of the regression predictions:

In [93]:
import numpy as np

y_mean = np.empty(143) #np.empty(shape,dtype=float,order='C') returns empty array with a shape of 143
y_mean.fill(y_pred.sum()/len(y_pred))
mean_squared_error(y_val, y_mean)

213.86417554358994

Since the Ridge Regression gives the lowest MSE, we will use it as our imputation method.

In [94]:
df = titanic_train[titanic_train['Age'].isnull()]
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Cabin_ID,Embark_C,Embark_Q
5,6,0,3,"Moran, Mr. James",1,NaN,0,0,330877,8.4583,NaN,Q,NaN,0,1
17,18,1,2,"Williams, Mr. Charles Eugene",1,NaN,0,0,244373,13.0000,NaN,S,NaN,0,0
19,20,1,3,"Masselmani, Mrs. Fatima",0,NaN,0,0,2649,7.2250,NaN,C,NaN,1,0
26,27,0,3,"Emir, Mr. Farred Chehab",1,NaN,0,0,2631,7.2250,NaN,C,NaN,1,0
28,29,1,3,"O'Dwyer, Miss. Ellen ""Nellie""",0,NaN,0,0,330959,7.8792,NaN,Q,NaN,0,1

In [97]:
X = df.iloc[:, [1,2,4,6,7,9,13,14]].values
y = reg.predict(X)
df['Age'] = y
titanic_train = new_train.append(df)
titanic_train.head()

ValueError: shapes (177,8) and (7,) not aligned: 8 (dim 1) != 7 (dim 0)

In [78]:
df_test = test[test['Age'].isnull()]
df_test.head()

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Cabin_ID,Embark_C,Embark_Q
10,902,3,"Ilieff, Mr. Ylio",1,NaN,0,0,349220,7.8958,NaN,S,NaN,0,0
22,914,1,"Flegenheim, Mrs. Alfred (Antoinette)",0,NaN,0,0,PC 17598,31.6833,NaN,S,NaN,0,0
29,921,3,"Samaan, Mr. Elias",1,NaN,2,0,2662,21.6792,NaN,C,NaN,1,0
33,925,3,"Johnston, Mrs. Andrew G (Elizabeth Lily"" Watson)""",0,NaN,1,2,W./C. 6607,23.4500,NaN,S,NaN,0,0
36,928,3,"Roth, Miss. Sarah A",0,NaN,0,0,342712,8.0500,NaN,S,NaN,0,0

In [ ]:
Xt = df_test.iloc[:,[1,3,5,6,8,12,13]].values
yt = reg.predict(Xt)
df_test['Age'] = yt
test = new_test.append(df_test)
test.head()

In [ ]:
print("Mean Age: ", titanic_train['Age'].mean())
print("Median Age: ", titanic_train['Age'].median())

# Imputing Missing Cabin Variable

In [ ]:
#let's predict the missing values of cabin_id
new_train = titanic_train[titanic_train['Cabin_ID'].notnull()]
print(new_train.head(),new_train.shape)

In [ ]:
X = new_train.iloc[:, [1,2,4,5,6,7,9,13,14]].values
y = new_train.iloc[:, 12].values
print(X, y)

In [ ]:
new_train['Cabin_ID'].value_counts()

## Support Vector Machine

In [ ]:
from sklearn.model_selection import cross_val_score, ShuffleSplit
from sklearn.svm import SVC

clf = SVC(kernel='linear', C=1)
clf.fit(X,y)
cv = ShuffleSplit(n_splits=10, test_size=.2, random_state=0)
scores = cross_val_score(clf, X, y, cv=4)
scores.mean()

## Logistic Regression

In [ ]:
from sklearn.linear_model import LogisticRegression

clf = LogisticRegression()
clf.fit(X,y)
cv = ShuffleSplit(n_splits=10, test_size=.2, random_state=0)
scores = cross_val_score(clf, X, y, cv=4)
scores.mean()

## Random Forest Classifier

In [ ]:
from sklearn.ensemble import RandomForestClassifier

clf = RandomForestClassifier(max_depth=8, random_state=0)
clf.fit(X,y)
cv = ShuffleSplit(n_splits=10, test_size=.2, random_state=0)
scores = cross_val_score(clf, X, y, cv=4)
scores.mean()

## KNN

In [ ]:
from sklearn.neighbors import KNeighborsClassifier

clf = KNeighborsClassifier(n_neighbors=1)
clf.fit(X,y)
cv = ShuffleSplit(n_splits=10, test_size=.2, random_state=0)
scores = cross_val_score(clf, X, y, cv=4)
scores.mean()

KNN provides the best accuracy score so we'll use this method to impute the Cabin variable.

In [ ]:
# here new_train will store all the data with NaN in Cabin
df = titanic_train[titanic_train['Cabin_ID'].isnull()]
df.head()

In [ ]:
X = df.iloc[:, [1,2,4,5,6,7,9,13,14]].values
print(X)

In [ ]:
pred = clf.predict(X)
print(pred)

In [ ]:
# add predictions of Cabin_ID to dataframe
df['Cabin_ID'] = pred
df['Cabin_ID'].value_counts()

In [ ]:
titanic_train = new_train.append(df)
print(titanic_train.head(), titanic_train.shape)

In [ ]:
titanic_train.isnull().sum()

In [ ]:
titanic_train = titanic_train.drop(['PassengerId','Name','Ticket','Embarked','Cabin'], axis=1)
titanic_train.head()

In [ ]:
Cabin_dum = pd.get_dummies(titanic_train['Cabin_ID'])
Cabin_dum.head()

In [ ]:
Cabin_dum = Cabin_dum.drop('T', axis=1)
Cabin_dum.head()

In [ ]:
# append cabin dummies to dataframe
for i in Cabin_dum.columns:
    titanic_train['Cabin_'+ str(i)] = Cabin_dum[i]

In [ ]:
print(titanic_train.head(), titanic_train.shape)

In [ ]:
titanic_train = titanic_train.drop('Cabin_ID',axis=1)
titanic_train.shape

# Final Models
## Support Vector Machines

In [ ]:
X = titanic_train.iloc[:,1:16].values
print(X, X.shape)

In [ ]:
y = titanic_train.iloc[:,0].values

In [ ]:
clf = SVC(kernel='linear', C=1)
clf.fit(X,y)
cv = ShuffleSplit(n_splits=10, test_size=.2, random_state=0)
scores = cross_val_score(clf, X, y, cv=4)
scores.mean()

## Random Forest

In [ ]:
clf = RandomForestClassifier(max_depth=15,random_state=0)
clf.fit(X,y)
cv = ShuffleSplit(n_splits=10, test_size=.2, random_state=0)
scores = cross_val_score(clf, X, y, cv=4)
scores.mean()

## KNN

In [ ]:
clf = KNeighborsClassifier(n_neighbors=1)
clf.fit(X,y)
cv = ShuffleSplit(n_splits=10, test_size=.2, random_state=0)
scores = cross_val_score(clf, X, y, cv=4)
scores.mean()